stm32duino/LIS2DU12/src/lis2du12_reg.h
#define LIS2DU12_SIXD_SRC      0x23U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl          : 1;
  uint8_t xh          : 1;
  uint8_t yl          : 1;
  uint8_t yh          : 1;
  uint8_t zl          : 1;
  uint8_t zh          : 1;
  uint8_t sixd_ia     : 1;
  uint8_t not_used_01 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 1;
  uint8_t sixd_ia     : 1;
  uint8_t zh          : 1;
  uint8_t zl          : 1;
  uint8_t yh          : 1;
  uint8_t yl          : 1;
  uint8_t xh          : 1;
  uint8_t xl          : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_sixd_src_t;

#define LIS2DU12_ALL_INT_SRC   0x24U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ia_all       : 1;
  uint8_t wu_ia_all       : 1;
  uint8_t single_tap_all  : 1;
  uint8_t double_tap_all  : 1;
  uint8_t sixd_ia_all     : 1;
  uint8_t sleep_change_ia : 1;
  uint8_t int_global      : 1;
  uint8_t not_used_01     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01     : 1;
  uint8_t int_global      : 1;
  uint8_t sleep_change_ia : 1;
  uint8_t sixd_ia_all     : 1;
  uint8_t double_tap_all  : 1;
  uint8_t single_tap_all  : 1;
  uint8_t wu_ia_all       : 1;
  uint8_t ff_ia_all       : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_all_int_src_t;

#define LIS2DU12_STATUS        0x25U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t drdy        : 1;
  uint8_t pd_status   : 1;
  uint8_t not_used_01 : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01 : 6;
  uint8_t pd_status   : 1;
  uint8_t drdy        : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_status_register_t;

#define LIS2DU12_FIFO_STATUS1  0x26U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01 : 6;
  uint8_t fifo_ovr    : 1;
  uint8_t fth         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fth         : 1;
  uint8_t fifo_ovr    : 1;
  uint8_t not_used_01 : 6;
#endif /* DRV_BYTE_ORDER */
} lis2du12_fifo_status1_t;

#define LIS2DU12_FIFO_STATUS2  0x27U
typedef struct {
  uint8_t fss    : 8;
} lis2du12_fifo_status2_t;

#define LIS2DU12_OUTX_L        0x28U
#define LIS2DU12_OUTX_H        0x29U
#define LIS2DU12_OUTY_L        0x2AU
#define LIS2DU12_OUTY_H        0x2BU
#define LIS2DU12_OUTZ_L        0x2CU
#define LIS2DU12_OUTZ_H        0x2DU
#define LIS2DU12_OUTT_L        0x2EU
#define LIS2DU12_OUTT_H        0x2FU
#define LIS2DU12_TEMP_OUT_L    0x30U
#define LIS2DU12_TEMP_OUT_H    0x31U
#define LIS2DU12_WHO_AM_I      0x43U

#define LIS2DU12_ST_SIGN       0x58U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01 : 5;
  uint8_t stsign      : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t stsign      : 3;
  uint8_t not_used_01 : 5;
#endif /* DRV_BYTE_ORDER */
} lis2du12_st_sign_t;

/**
  * @defgroup LIS2DU12_Register_Union
  * @brief    This union group all the registers that has a bitfield
  *           description.
  *           This union is useful but not need by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */

typedef union {
  lis2du12_if_pu_ctrl_t      if_pu_ctrl;
  lis2du12_if_ctrl_t         if_ctrl;
  lis2du12_ctrl1_t           ctrl1;
  lis2du12_ctrl2_t           ctrl2;
  lis2du12_ctrl3_t           ctrl3;
  lis2du12_ctrl4_t           ctrl4;
  lis2du12_ctrl5_t           ctrl5;
  lis2du12_fifo_ctrl_t       fifo_ctrl;
  lis2du12_fifo_wtm_t        fifo_wtm;
  lis2du12_interrupt_cfg_t   interrupt_cfg;
  lis2du12_tap_ths_x_t       tap_ths_x;
  lis2du12_tap_ths_y_t       tap_ths_y;
  lis2du12_tap_ths_z_t       tap_ths_z;
  lis2du12_int_dur_t         int_dur;
  lis2du12_wake_up_ths_t     wake_up_ths;
  lis2du12_wake_up_dur_t     wake_up_dur;
  lis2du12_free_fall_t       free_fall;
  lis2du12_md1_cfg_t         md1_cfg;
  lis2du12_md2_cfg_t         md2_cfg;
  lis2du12_wake_up_src_t     wake_up_src;
  lis2du12_tap_src_t         tap_src;
  lis2du12_sixd_src_t        sixd_src;
  lis2du12_all_int_src_t     all_int_src;
  lis2du12_status_register_t status_register;
  lis2du12_fifo_status1_t    fifo_status1;
  lis2du12_fifo_status2_t    fifo_status2;
  bitwise_t                  bitwise;
  uint8_t                    byte;
} lis2du12_reg_t;

/**
  * @}
  *
  */

int32_t lis2du12_read_reg(lis2du12_ctx_t *ctx, uint8_t reg, uint8_t *data,
                          uint16_t len);
int32_t lis2du12_write_reg(lis2du12_ctx_t *ctx, uint8_t reg, uint8_t *data,
                           uint16_t len);

float_t lis2du12_from_fs2g_to_mg(int16_t lsb);
float_t lis2du12_from_fs4g_to_mg(int16_t lsb);
float_t lis2du12_from_fs8g_to_mg(int16_t lsb);
float_t lis2du12_from_fs16g_to_mg(int16_t lsb);
float_t lis2du12_from_lsb_to_celsius(int16_t lsb);

typedef struct {
  uint8_t whoami;
} lis2du12_id_t;
int32_t lis2du12_id_get(lis2du12_ctx_t *ctx, lis2du12_id_t *val);

typedef enum {
  LIS2DU12_SEL_BY_HW   = 0x00, /* bus mode select by HW (SPI 3W disable) */
  LIS2DU12_SPI_4W      = 0x03, /* Only SPI: SDO / SDI separated pins */
  LIS2DU12_SPI_3W      = 0x07, /* Only SPI: SDO / SDI share the same pin */
  LIS2DU12_I3C_DISABLE = 0x01, /* Select by HW (SPI 3W and I3C disable) */
} lis2du12_bus_mode_t;
int32_t lis2du12_bus_mode_set(lis2du12_ctx_t *ctx, lis2du12_bus_mode_t val);
int32_t lis2du12_bus_mode_get(lis2du12_ctx_t *ctx, lis2du12_bus_mode_t *val);

typedef enum {
  LIS2DU12_DRV_RDY   = 0x00, /* Initialize the device for driver usage */
  LIS2DU12_BOOT      = 0x01, /* Restore calib. param. ( it takes 10ms ) */
  LIS2DU12_RESET     = 0x02, /* Reset configuration registers */
} lis2du12_init_t;
int32_t lis2du12_init_set(lis2du12_ctx_t *ctx, lis2du12_init_t val);

typedef struct {
  uint8_t sw_reset           : 1; /* Restoring configuration registers */
  uint8_t boot               : 1; /* Restoring calibration parameters */
  uint8_t drdy_xl            : 1; /* Accelerometer data ready */
  uint8_t power_down         : 1; /* Monitors power-down. */
} lis2du12_status_t;
int32_t lis2du12_status_get(lis2du12_ctx_t *ctx, lis2du12_status_t *val);

