stm32duino/LIS2DU12/src/lis2du12_reg.h
int32_t lis2du12_interrupt_mode_set(lis2du12_ctx_t *ctx,
                                    lis2du12_int_mode_t *val);
int32_t lis2du12_interrupt_mode_get(lis2du12_ctx_t *ctx,
                                    lis2du12_int_mode_t *val);

typedef struct {
  uint8_t drdy_xl       : 1; /* Accelerometer data ready */
  uint8_t boot          : 1; /* Restoring calibration parameters */
  uint8_t fifo_th       : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr      : 1; /* FIFO overrun */
  uint8_t fifo_full     : 1; /* FIFO full */
  uint8_t free_fall     : 1; /* free fall event */
  uint8_t six_d         : 1; /* orientation change (6D/4D detection) */
  uint8_t single_tap    : 1; /* single-tap event */
  uint8_t tap           : 1; /* all tap event */
  uint8_t wake_up       : 1; /* wake up event */
  uint8_t sleep_change  : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_state   :  1; /* Act/Inact status flag */
} lis2du12_pin_int1_route_t;
int32_t lis2du12_pin_int1_route_set(lis2du12_ctx_t *ctx,
                                    lis2du12_pin_int1_route_t *val);
int32_t lis2du12_pin_int1_route_get(lis2du12_ctx_t *ctx,
                                    lis2du12_pin_int1_route_t *val);

typedef struct {
  uint8_t drdy_xl       : 1; /* Accelerometer data ready */
  uint8_t boot          : 1; /* Restoring calibration parameters */
  uint8_t fifo_th       : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr      : 1; /* FIFO overrun */
  uint8_t fifo_full     : 1; /* FIFO full */
  uint8_t free_fall     : 1; /* free fall event */
  uint8_t six_d         : 1; /* orientation change (6D/4D detection) */
  uint8_t single_tap    : 1; /* single-tap event */
  uint8_t tap           : 1; /* all tap event */
  uint8_t wake_up       : 1; /* wake up event */
  uint8_t sleep_change  : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_state   : 1; /* Act/Inact status flag */
} lis2du12_pin_int2_route_t;
int32_t lis2du12_pin_int2_route_set(lis2du12_ctx_t *ctx,
                                    lis2du12_pin_int2_route_t *val);
int32_t lis2du12_pin_int2_route_get(lis2du12_ctx_t *ctx,
                                    lis2du12_pin_int2_route_t *val);

typedef struct {
  uint8_t x_en  : 1; /* Detection on X-axis */
  uint8_t y_en  : 1; /* Detection on Y-axis */
  uint8_t z_en  : 1; /* Detection on Z-axis */
  uint8_t threshold; /* full scale dependent */
  uint8_t duration;  /* 1 LSb: 1 ODR_time */
  struct {
    uint8_t en  : 1; /* Enable sleep detection */
    uint8_t duration; /* 0 is 16 ODR_time, 1 LSB: 512 ODR_time. */
    enum {
      LIS2DU12_DO_NOT_CHANGE = 0,
      LIS2DU12_SLEEP_AT_6Hz  = 1,
      LIS2DU12_SLEEP_AT_3Hz  = 2,
      LIS2DU12_SLEEP_AT_1Hz5 = 3,
    } odr;
  } sleep;
} lis2du12_wkup_md_t;
int32_t lis2du12_wake_up_mode_set(lis2du12_ctx_t *ctx, lis2du12_wkup_md_t *val);
int32_t lis2du12_wake_up_mode_get(lis2du12_ctx_t *ctx, lis2du12_wkup_md_t *val);

typedef struct {
  uint8_t x_en  : 1; /* Detection on X-axis */
  uint8_t y_en  : 1; /* Detection on Y-axis */
  uint8_t z_en  : 1; /* Detection on Z-axis */
  struct {
    uint8_t x;
    uint8_t y;
    uint8_t z;
  } threshold;
  uint8_t shock; /* max shock time. 0 is 4 ODR_time, 1 LSb : 8 ODR_time. */
  uint8_t quiet; /* Time after a tap. 0 is 2 ODR_time, 1 LSB : 4 ODR_time.*/
  enum {
    LIS2DU12_XYZ = 0,
    LIS2DU12_YXZ = 1,
    LIS2DU12_XZY = 2,
    LIS2DU12_ZYX = 3,
    LIS2DU12_YZX = 5,
    LIS2DU12_ZXY = 6,
  } priority;
  struct {
    uint8_t en  : 1; /* Double tap detection */
    uint8_t latency; /* Max time gap. 0 is 16 ODR_time, 1 LSB : 32 ODR_time. */
  } tap_double;
} lis2du12_tap_md_t;
int32_t lis2du12_tap_mode_set(lis2du12_ctx_t *ctx, lis2du12_tap_md_t *val);
int32_t lis2du12_tap_mode_get(lis2du12_ctx_t *ctx, lis2du12_tap_md_t *val);

typedef struct {
  enum {
    LIS2DU12_156mg = 0,
    LIS2DU12_219mg = 1,
    LIS2DU12_250mg = 2,
    LIS2DU12_312mg = 3,
    LIS2DU12_344mg = 4,
    LIS2DU12_406mg = 5,
    LIS2DU12_469mg = 6,
    LIS2DU12_500mg = 7,
  } threshold;
  uint8_t duration; /* 1 LSb: 1 ODR_time */
} lis2du12_ff_md_t;
int32_t lis2du12_free_fall_mode_set(lis2du12_ctx_t *ctx, lis2du12_ff_md_t *val);
int32_t lis2du12_free_fall_mode_get(lis2du12_ctx_t *ctx, lis2du12_ff_md_t *val);

typedef struct {
  enum {
    LIS2DU12_DEG_80 = 0,
    LIS2DU12_DEG_70 = 1,
    LIS2DU12_DEG_60 = 2,
    LIS2DU12_DEG_50 = 3,
  } threshold;
  enum {
    LIS2DU12_SIX  = 0,
    LIS2DU12_FOUR = 1,
  } deg_of_freedom;
} lis2du12_orient_md_t;
int32_t lis2du12_orientation_mode_set(lis2du12_ctx_t *ctx,
                                      lis2du12_orient_md_t *val);
int32_t lis2du12_orientation_mode_get(lis2du12_ctx_t *ctx,
                                      lis2du12_orient_md_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LIS2DU12_REGS_H */
